/* **** Взаимодействие пользовотеля и js на сайте **** */

"use strict"; // работаем в современном режиме

// alert('Hello');

// преременная rusult всплывающее окно

// const result = confirm("Are you here?");
// console.log(result);

// преременная answer всплывающее окно другой конструкции. в переменной answer тип данных будет всегда строка. *********Вся информация приходящая от пользователя будет ввиде строк.********
// const answer = +prompt('Вам есть 18?', '18'); // для того чтобы помять тип данных на цифровой нужно добавить +
// console.log(typeof(answer)); // typeof команда чтобы увидеть какой тип данных будет присвоен 
// console.log(answer + 3);

// массив данных 

const answers = [];
// answers[0] = prompt('Как ваше имя?', '');
// answers[1] = prompt('Как ваше фамилия?', '');
// answers[2] = prompt('Сколько вам лет?', '');

document.write(answers); // вывод данных на странице